src/cf/Catalogs/CRM_ДействияТриггеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ДействияТриггеров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбработкаДействия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКОбработке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьПоПути</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяСтандартнаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/CRM_ДействияТриггеров/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьВидимость()
	Элементы.ПутьКОбработке.Видимость = Объект.РежимОтладки;
	Элементы.ВыгрузитьОбработку.Видимость = НЕ Объект.РежимОтладки;
	Элементы.ЗагрузитьОбработку.Видимость = НЕ Объект.РежимОтладки;
	Элементы.ЗагрузитьСтандартнуюОбработку.Видимость = Объект.Предопределенный и НЕ Объект.РежимОтладки;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОбработку()
	ПараметрыЗащиты = Новый("ОписаниеЗащитыОтОпасныхДействий"+"");
	ПараметрыЗащиты.ПредупреждатьОбОпасныхДействиях = ЛОЖЬ;                                            
	
	//Данные = Новый ДвоичныеДанные(Объект.ПутьКОбработке);
	//АдресФайла = ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
	Объект.ИспользуетсяСтандартнаяОбработка = Ложь;
	
	Обработка =  ВнешниеОбработки.Создать(ВнешниеОбработки.Подключить(АдресФайла,,Ложь, ПараметрыЗащиты), Ложь);
	Объект.НазваниеОбработки = Обработка.Метаданные().Имя;
	Если Объект.Наименование = "" Тогда	
		Объект.Наименование = Обработка.Метаданные().Синоним;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ПутьКОбработкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		
	ДиалогВыбораФайла.Фильтр = "Файл обработки (*.epf)|*.epf";
	ДиалогВыбораФайла.Расширение = "html";
	
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выберите файл'");
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.ИндексФильтра = 0;
	ДиалогВыбораФайла.ПолноеИмяФайла = Объект.ПутьКОбработке;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = истина;
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ПутьКОбработкеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));

КонецПроцедуры

&НаКлиенте
Процедура ПутьКОбработкеНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		
		Объект.ПутьКОбработке		= ДиалогВыбораФайла.ПолноеИмяФайла;
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ДанныеФайла = ОбъектЗначение.ОбработкаДействия.Получить();
	АдресФайла = ПоместитьВоВременноеХранилище(ДанныеФайла, УникальныйИдентификатор);
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция ПолучитьДвоичныеДанныеИзХранилища()
	ОбъектПолучения = РеквизитФормыВЗначение("Объект");
	Возврат(ОбъектПолучения.ОбработкаДействия.Получить());
КонецФункции

&НаКлиенте
Процедура ПодготовитьКВыгрузкеОбработкуНаСервере()
	//ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ДанныеФайла = ПолучитьДвоичныеДанныеИзХранилища();
	АдресФайла = ПоместитьВоВременноеХранилище(ДанныеФайла, УникальныйИдентификатор);
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьОбработку(Команда)
	ПодготовитьКВыгрузкеОбработкуНаСервере();

	ОбщегоНазначенияКлиент.ПроверитьРасширениеРаботыСФайламиПодключено(
			Новый ОписаниеОповещения(
				"ВыгрузитьОбработкуПродолжение",
				ЭтотОбъект,
				Новый Структура),
			НСтр("ru = 'Для продолжения необходимо установить расширение для работы с файлами.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбработкуПродолжение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

    ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтаФорма);
	ИмяФайла = Объект.НазваниеОбработки+".epf";
	Файл = Новый ОписаниеПередаваемогоФайла(ИмяФайла, АдресФайла);
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(Файл);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.Фильтр = "(*.epf)|*.epf";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, ДиалогОткрытияФайла, Истина);
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

    Если ПомещенныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Для каждого ПереданныйФайл Из ПомещенныеФайлы Цикл
		Объект.ПутьКОбработке		= ПереданныйФайл.Имя;
		ЭтаФорма.Модифицированность = Истина;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьОбработку1(Команда)
	
	ОбщегоНазначенияКлиент.ПроверитьРасширениеРаботыСФайламиПодключено(
			Новый ОписаниеОповещения(
				"ЗагрузитьОбработкуПродолжение",
				ЭтотОбъект,
				Новый Структура),
			НСтр("ru = 'Для продолжения необходимо установить расширение для работы с файлами.'"));

КонецПроцедуры
	
&НаКлиенте
Процедура ЗагрузитьОбработкуПродолжение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

	ОписаниеОповещенияЗавершения = Новый ОписаниеОповещения("ВопросЗагрузитьОбработку", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещенияЗавершения, "Вы хотите загрузить новую обработку действия ?", РежимДиалогаВопрос.ДаНет);
    
КонецПроцедуры


&НаКлиенте
Процедура ВопросЗагрузитьОбработку(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьОбработкуЗавершение", ЭтаФорма);
		ИмяФайла = Объект.НазваниеОбработки+".epf";
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.Фильтр = "(*.epf)|*.epf";
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		НачатьПомещениеФайлов(ОписаниеОповещения, , ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбработкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		АдресФайла = Результат[0].Хранение;
		Объект.ПутьКОбработке = Результат[0].Имя;
		ЗагрузитьОбработку();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РежимОтладкиПриИзменении(Элемент)
	Если НЕ Объект.РежимОтладки Тогда
		ОписаниеОповещенияЗавершения = Новый ОписаниеОповещения("ВопросЗагрузитьОбработку", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияЗавершения, "Вы хотите загрузить новую обработку действия ?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		
		ДиалогВыбораФайла.Фильтр = "Файл обработки (*.epf)|*.epf";
		ДиалогВыбораФайла.Расширение = "html";
		
		ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выберите файл'");
		ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
		ДиалогВыбораФайла.ИндексФильтра = 0;
		ДиалогВыбораФайла.ПолноеИмяФайла = Объект.ПутьКОбработке;
		ДиалогВыбораФайла.ПроверятьСуществованиеФайла = истина;
		
		ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("РежимОтладкиПриИзмененииЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));
        Возврат;
	КонецЕсли;	    
	РежимОтладкиПриИзмененииФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура РежимОтладкиПриИзмененииЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		
		Объект.ПутьКОбработке		= ДиалогВыбораФайла.ПолноеИмяФайла;
		
		//ЗагрузитьОбработку();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
	РежимОтладкиПриИзмененииФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура РежимОтладкиПриИзмененииФрагмент()
	
	УстановитьВидимость();

КонецПроцедуры


&НаСервере
Процедура ЗагрузитьСтандартнуюОбработкуНаСервере()
	
	Если Объект.ИмяПредопределенныхДанных = "ОповещениеПочта" Тогда
		АдресФайла = ПоместитьВоВременноеХранилище(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерПочтовойРассылки"), УникальныйИдентификатор);
		Объект.НазваниеОбработки = "CRM_ТриггерПочтовойРассылки";
	ИначеЕсли Объект.ИмяПредопределенныхДанных = "ОповещениеСМС" Тогда	
		АдресФайла = ПоместитьВоВременноеХранилище(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерСМСРассылки"), УникальныйИдентификатор);
		Объект.НазваниеОбработки = "CRM_ТриггерСМСРассылки";
	ИначеЕсли Объект.ИмяПредопределенныхДанных = "ОповещениеНапоминание" Тогда	
		АдресФайла = ПоместитьВоВременноеХранилище(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерНапоминание"), УникальныйИдентификатор);
		Объект.НазваниеОбработки = "CRM_ТриггерНапоминание";
	ИначеЕсли Объект.ИмяПредопределенныхДанных = "ЗапретитьРедактированиеДокументаКоммерческоеПредложение" Тогда	
		АдресФайла = ПоместитьВоВременноеХранилище(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ЗапретитьРедактированиеКП"), УникальныйИдентификатор);
		Объект.НазваниеОбработки = "CRM_ЗапретитьРедактированиеКП";	
	ИначеЕсли Объект.ИмяПредопределенныхДанных = "РассылкаПоСегменту" Тогда	
		АдресФайла = ПоместитьВоВременноеХранилище(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерРассылкаПоСегменту"), УникальныйИдентификатор);
		Объект.НазваниеОбработки = "CRM_ТриггерРассылкаПоСегменту";		
	ИначеЕсли Объект.ИмяПредопределенныхДанных = "ЗаявкаССайта" Тогда	
		АдресФайла = ПоместитьВоВременноеХранилище(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерЗаявкаССайта"), УникальныйИдентификатор);
		Объект.НазваниеОбработки = "CRM_ТриггерЗаявкаССайта";		
	ИначеЕсли Объект.ИмяПредопределенныхДанных = "ВосстановлениеИнтереса" Тогда	
		АдресФайла = ПоместитьВоВременноеХранилище(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерВосстановлениеИнтереса"), УникальныйИдентификатор);
		Объект.НазваниеОбработки = "CRM_ТриггерВосстановлениеИнтереса";				
	КонецЕсли;	
	
	Объект.ИспользуетсяСтандартнаяОбработка = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьСтандартнуюОбработку(Команда)
	ЗагрузитьСтандартнуюОбработкуНаСервере();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если ВебКлиент Тогда
		Элементы.РежимОтладки.Видимость = Ложь;
	#КонецЕсли
КонецПроцедуры
